org-content/hugo.org
#+STARTUP: content
#+options: author:nil
#+HUGO_BASE_DIR: ../
#+hugo_level_offset: 0


** DONE Org Mode and Google Calendar :@Productivity:org_mode:google_calendar:
CLOSED: [2020-09-27 Sun 17:46]
:PROPERTIES:
:EXPORT_HUGO_BUNDLE: org-mode-and-google-calendar
:EXPORT_FILE_NAME: index
:END:
:LOGBOOK:
CLOCK: [2020-09-25 Fri 10:15]--[2020-09-25 Fri 12:56] =>  2:41
:END:

I've been having an internal debate over org mode and google calendar. Normally I manage the scheduling of my courses using Google Calendar, but would it be better to use org mode instead?

*** Google Calendar Pros
- Great mobile support
- Reply "Yes" or "No" to event invitations
- Great display
- Reminders
- Share calendars with other people
- Color coding

*** Org Mode Pros
- Time tracking
- Note taking
- Vim bindings
- Less context switching
- The benefits of org

*** Deciding Questions
Don't need a perfect system. Looking for something good. If it ain't broke don't fix it.
- What am I missing by using org mode?

  I feel like I am missing shared calendars and a great weekly view.
- Are shared calendars valuable?

  My understanding is that they practically become a necessity once entering the work force. Personally, however, I currently have no use for them.
- Is a great weekly view valuable?

  It makes it easy to see conflicting events, and how they are spaced out throughout your day.

*** COMMENT LifeStyle
In answering these questions I think it's important to consider you own lifestyle.

Different modes:
- Student
  - Many deadlines
  - No shared calendar
- Worker
  - Fewer deadlines
  - Shared calendar

Personally I am a student so I will keep the student's needs in mind when making my decision. The main difference I see is that I don't have to worry about shared calendars as much.

*** Options
**** Separated
Use org mode for todos/deadlines and google calendar for scheduled events.

This allows you to get all the benefits of google calendar for scheduled events, and all the benefits of org mode for todos/deadlines. A potential downside is that this approach requires more context switching. You'll have to consult the org agenda and the google calendar at the same time in order to make sure that you aren't missing anything.

Time tracking becomes difficult, because if you want to time track an event from the calendar, you'll have to duplicate it into org. This might not be so bad though. My main events would be:
- lectures
- meetings

And it's not important to get fine grained time tracking to the specific meeting itself. A general task of =meetings= for a set of categories that I could clock to would suffice.

**** Synced
By using [[https://github.com/myuhe/org-gcal.el][org-gcal]], you can push events from org mode to google calendar, and pull them from google calendar to org mode.

In either case you get to take advantage of the google calendar view without giving up org mode, but there are some limitations to the integration.
- repeating org events
- coloring

You also have to deal with the potential headache of keeping everything synced up.

**** Isolated
Use org mode for everything and don't use google calendar

There are solutions like =emacs-calfw= that try to implement a better calendar view for org mode. The experience is not as nice as google calendar though.

It can be problematic to completely give up google calendar. Shared calendars come to mind. It is hard to escape google calendar.

It's important to remember the main points of google calendars view:
- easily find event conflicts
- visualize the weekly schedule

Both of these points can be accomplished from the org agenda, but not as well.

*** Next Steps

Sometimes it's more effective to experiment then to theorize. After reflecting on the options I've decided I won't pursue the syncing strategy; dealing with syncing would produce a headache that outweights the potential benefits.

This leaves me deciding between isolated and separated. The main difference being that separated gives better weekly view, and isolated means "inline" notes for events.  At first I had an irrational fear of the separated approach, but now I am warming up to it. Even so, I'm gonna give the isolated appraoach a go for a couple weeks and see if I feel like I am missing anything.

Stay tuned by subscribing to the [[https://colekillian.com/index.xml][rss feed]] and feel free to leave a comment below!

Links:
- [[https://irreal.org/blog/?p=5839][Irreal Post on Syncing GCal with Org Agenda]]
- [[https://github.com/kiwanami/emacs-calfw/][Emacs Calendar]]
